Descriptor:
  Name: fetch sentinel incident comments
  DisplayName: "fetch sentinel incident comments"
  Description: pullback sentinel incident comments
SkillGroups:
  - Format: KQL
    Skills:
      - Name: fetch sentinel incident comments
        DisplayName: fetch sentinel incident comments
        Description: fetch sentinel incident comments
        Inputs:
          - Name: incidentNumber
            Description: incident number
            Required: true
        Settings:
          Target: Sentinel
          TenantId: xxxxx
          SubscriptionId: xxxxx
          ResourceGroupName: xxxxx
          WorkspaceName: xxxxx
          Template: |- 
            SecurityIncident
            | where TimeGenerated > ago(14d) 
            | where IncidentNumber == '{{incidentNumber}}' 
            | summarize arg_max(TimeGenerated, *) by IncidentNumber 
            | where isnotempty( Comments) and Comments != '[]' 
            | project Comments