Descriptor:
  Name: Summarize Sentinel Entities across MITRE tactics for a specified time and date range.
  DisplayName: "Sentinel Entities on MITRE"
  Description: Skills summarizes Entities from the alerts from Sentinel workspace.
  #Can you lookup what my Sentinel costs are for the past 7 days?
  #Can you provide a detailed summary of my total Sentinel costs for the past 90 days? Be sure to explain what each table is used for within Sentinel and the security value it provides. Also total up all the costs to give me an average monthly cost. Also be sure to give any cost saving recommendations based on my data ingestion.
SkillGroups:
  - Format: KQL
    Skills:
      - Name: SentinelEntitiesonMITRE
        DisplayName: Sentinel Entities on MITRE
        Description: Summarizes the entities created in Sentinel for the specified time and date range.
        Inputs:
          - Name: fromDateTime
            Description: The from time and date
            Required: true
          - Name: toDateTime
            Description: The to time and date
            Required: true
        Settings:
          Target: Sentinel
           # The ID of the AAD Organization that the Sentinel workspace is in.
          TenantId: **ENTRA TENANT GUID**
          # The id of the Azure Subscription that the Sentinel workspace is in.
          SubscriptionId: **AZURE SUBSCRIPTION ID**
          # The name of the Resource Group that the Sentinel workspace is in.
          ResourceGroupName: **LOG ANALYTICS RESOURCE GROUP NAME**
          # The name of the Sentinel workspace.
          WorkspaceName: **LOG ANALYTICS WORKSPACE NAME**
          Template: |-
            let fromDateTime=datetime('{{fromDateTime}}');
            let toDateTime=datetime('{{toDateTime}}');
            SecurityAlert
            | where TimeGenerated between ( fromDateTime .. toDateTime )
            | summarize arg_max(TimeGenerated,*) by SystemAlertId
            | where isnotempty(Tactics)
            | extend Tactics = split(Tactics,',')
            | mv-expand Tactics
            | extend Tactics = tostring(Tactics)
            | mv-expand todynamic(Entities)
            | extend EntityType = tostring(Entities.Type)
            | summarize count(), make_set(Entities) by EntityType, Tactics, ProductName
            | order by count_ desc

