Descriptor:
  Name: MDAAdvancedThreatProtection
  DisplayName: MDA Advanced Threat Protection
  Description: Skills to query MDA tables to get insights about files quarantined by Advanced Threat Protection (ATP)

SkillGroups:
  - Format: KQL
    Skills:
      - Name: GetCloudAppATPEvents
        DisplayName: Get Cloud App ATP Events
        Description: Fetches a list of Advanced Threat Protection events within a specified timeframe
        ExamplePrompt:
        - 'OneDrive Malware'
        - 'SharePoint Malware'
        - 'Cloud App ATP'
        Inputs:
          - Name: hourorday
            Description: hours (h) or days (d)
            Required: false
            DefaultValue: d
          - Name: unit
            Description: number of hours or days
            Required: false
            DefaultValue: 7
        Settings:
          Target: Defender
          Template: |-
            CloudAppEvents
            | where Timestamp >= ago({{unit}}{{hourorday}})
            | where ActionType == @"AtpDetection"
            | extend FileName=parse_json(RawEventData).FileData.FileName, FilePath=parse_json(RawEventData).FileData.FilePath, MalwareFamily=parse_json(RawEventData).FileData.MalwareFamily
            | project Timestamp, ActionType, Application, AccountObjectId, AccountDisplayName, FileName, FilePath, MalwareFamily
  - Format: KQL
    Skills:
      - Name: GetOfficeActivityATPEvents
        DisplayName: Get Office Activity ATP Events
        Description: Fetches a list of Advanced Threat Protection events within a specified timeframe
        ExamplePrompt:
        - 'OneDrive Malware'
        - 'SharePoint Malware'
        - 'Office Activity ATP'
        Inputs:
          - Name: hourorday
            Description: hours (h) or days (d)
            Required: false
            DefaultValue: d
          - Name: unit
            Description: number of hours or days
            Required: false
            DefaultValue: 7
        Settings:
          Target: Sentinel
          Template: |-
            OfficeActivity 
            | where TimeGenerated >= ago({{unit}}{{hourorday}}) 
            | where Operation == "FileMalwareDetected" and RecordType == "SharePointFileOperation"
            | project TimeGenerated, Operation, OfficeWorkload, OfficeObjectId, ClientIP, Site_Url, SourceRelativeUrl, SourceFileName
          TenantId: <your_tenant_id>
          SubscriptionId: <your_subscription_id>
          ResourceGroupName: <your_rg_name>
          WorkspaceName: <your_ws_name>
