Descriptor:
  Name: CfSLogins
  DisplayName: Copilot for Security Portal Logins
  Description: Identifies Copilot for Security Portal logins in the last 3 days

SkillGroups:
  - Format: KQL
    Skills:
      - Name: CfSLogins
        DisplayName: Copilot for Security Portal Logins
        Description: Identifies Copilot for Security Portal logins in the last 3 days
        Settings:
          Target: Sentinel
          TenantId: <your_tenant_ID>
          SubscriptionId: <your_subscription_ID>
          ResourceGroupName: <your_RG_name>
          WorkspaceName: <your_WS_name>
          Template: |-
            SigninLogs | where TimeGenerated >= ago(3d) | where AppDisplayName == "Medeina Portal" | project TimeGenerated, Identity, UserPrincipalName, AppDisplayName, OperationName
